  {"Sonia": "Who are you and how did you find this place?"},
  {"Terry": "I ask, who are you?"},
  {"Sonia": "Mad, arrest him..."},
  {"Mad": "Only if it is now..."},
  {"Terry": "Wait! I heard about this ship and came to see if it was real ... There was data on this robot that indicated where this ship was, I just wanted to see it again and ... Well, I've worked here before."},
  {"Sonia": "Were you GSA employee?"},
  {"Terry": "Yes, I was an Aerospace Engineer ... I honestly thought I was abandoned and wanted to use it to leave Earth ..."},
  {"Sonia": "Mad..."},
  {"Terry": "Why were you suddenly silent?"},
  {"Sonia": "You can't take it"},
  {"Terry": "From what I see of your clean clothes, they are from GSA and are living here ... But why didn't you use the ship to get out of here?"},
  {"Sonia": "..."},
  //Mad wait a moment
  {"Terry": "You already know that she is defective, right?"},
  {"Sonia": "..."},
  {"Terry": "Haha... Lucky for you that I am what I am and that I already worked on those ships."},
  {"Sonia": "What does this have to do with? "},
  {"Terry": "Well, I suggest you allow me ...!? Hun? What's your name, miss?"},
  {"Sonia": "Look seriously."},
  {"Terry": "Naughty smile."},
  {"Sonia": "Doctor Sonia..."},
  {"Terry": "Okay, Dr. Sonia, I suggest you allow me to fix the ship and in return I want to go with you to planet W-01, I believe this is where you plan to go, right?"},
  {"Mad": "Right..."},
  {"Terry": "But ... I want to take my friends from my camp with me ..."},
  {"Sonia": "And what guarantee will we have that he will do what he promised and fix the ship?"},
  {"Terry": "You will have to trust me persona doctor."},
  {"Sonia": "thoughtful"},
  {"Sonia": "Alright"},
  {"Mad": "Sonia..."},
  {"Sonia": "No, Mad, we need help and unfortunately, we don't have anyone who knows these ships, this one ... What's your name?"},
  {"Terry": "I'm Terry and this is BT, say hi buddy!"},
  {"BT": "Hi!"},
  {"Sonia": "This Terry here, can be useful to us, I'm a Planetary Engineer, I know how to deal with terraforming, this is Terry's area I don't have much knowledge."},
  {"Mad": "Okay, I don't like that decision, but that's okay."},
  {"Sonia": "Know what Terry can do and fix our ship, then you can participate in our trip."},
  {"Terry": "Leave it to me!"},
  {"BT": "I want you to scan the ship and look for repairs that we need to do, and tell me everything I need, can you do that buddy?"},
  {"BT": "You can leave Mr. Terry, that's it!"}
  //BT SCANS THE SHIP